# Задача 3. Файл-тест.

# комментарии по первой строке примера                   2 4 5;3 2     2+4+5/3 = 3, в остатке 1
with open('practice3.txt', 'r') as file:  # открываем файл и помещаем указатель на него в переменную file
    for line in file.readlines():  # циклом for перебираем строки файла, т.е. вначале в line попадает первая строка, потом вторая
        line = line.strip()  # в line перезаписываем (строка неизменна) ту же строку только обрезанную от пробелов
        line_1 = line.split(';')[0]  # разрезаем строку по ";" получаем список и первый элемент списка ложим в line_1
        line_2 = line.split(';')[1]  # разрезаем строку по ";" получаем список и второй элемент списка ложим в line_1
        current_sum = 0  # объявляем переменную current_sum куда будем суммировать цифры до ";"
        count = 0  # объявляем переменную count где будем считать цифры до ";"
        for c in line_1:  # циклом for перебираем все символы line_1 (это наши цифры до ";")
            if c.isdigit():  # метод isdigit() возвращает True если символ цифровой
                current_sum += int(c)  # цифра 2 - да цифра плюсуем к 0 (текущая сумма уже 2), пробел - пропускаем, цифра 4 - плюсуем (уже 6) пробел пропускаем, цифра 5 (уже имеем 11)
                count += 1  # здесь суммируем количество цифр (2 - количество 1, пробел - пропускаем, 4 - количество 2, пробел - пропускаем, 5 - количество 3)
        check_number = []  # объявляем список, где будем держать цифры после ";" первый элемент - 3, второй - 2
        for c in line_2:  # циклом for перебираем строку line_2
            if c.isdigit():  # опять если цифра работаем если пробел пропускаем
                check_number.append(int(c))  # цифра 3 - список уже [3, ] пробел - пропускаем, цифра 2 - список уже [3, 2]
        # по условию задачи сумма цифр current_sum = 11 делим на количество count = 3 целых 3 и в остатке 2
        # сравниваем тернарным оператором - и сумма 11 / количество 3 равно? первому элемента списка 3
        # и остаток от деления 11 % на 3 равен? 2, тогда переменной check присваиваем True, если не сходится - False
        check = True if current_sum // count == check_number[0] and current_sum % count == check_number[1] else False
        # печатаем форматной строкой f вначале саму строку с файла потом или True или False, т.е переменную check
        print(f'{line} - {check}')


